Backend/stress_tests/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET /hospitals,1000,1843,225,5288,515.46,0.000%,.95205,1.88,0.16,2027.0
GET /hospital/2,1000,1391,271,4625,375.78,0.000%,.95136,0.39,0.16,416.0
GET /specializations,1000,5837,1451,11166,970.32,0.000%,.94921,6.27,0.17,6765.0
GET /specialization/2,1000,1421,249,4939,437.01,0.000%,.95028,0.30,0.17,323.0
TOTAL,4000,2623,225,11166,1964.68,0.000%,3.79411,8.83,0.66,2382.8